app/views/books/_form.html.erb

SELECT "tags".* FROM "tags"
---
    <%= f.label :tag, class: "mr-10" %>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :title do |c| %>

SELECT "authors".* FROM "authors"
---
    <%= f.label :author, class: "mr-10" %>
    <%= f.collection_check_boxes :author_ids, Author.all, :id, :name do |c| %>