app/views/books/index.html.erb


  <%= render "shared/page_text_intro", model: Book.count, title: "books", description: "If you're interested in learning Ruby or Ruby on Rails, or if you want to brush up on your testing skills or learn more about other themes, you're in luck. There are plenty of free books available on these topics. Whether you're a beginner or an expert, you're sure to find something that interests you.", bg: false %>
---
SELECT "books".* FROM "books"

          <div class="flex flex-wrap gap-1 mb-6">
            <% book.tags.each do |item| %>
---
SELECT "tags".* FROM "tags"