app/views/tags/index.html.erb

<% content_for :hero do %>
  <%= render "shared/page_title", title: "What would you like to learn more about? ", description: "If you're looking to learn more about programming, we've got a few resources that might interest you. Whatever your interest, we're sure we can find a book or course that's perfect for you.", count: "#{Tag.count} topics"  %>
---
SELECT "tags".* FROM "tags"