app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @authors = Author.all.order("name ASC")
    @tags = Tag.all.order(:title)

    set_meta_tags title: "#{Author.count} authors writing about Ruby & Ruby on Rails", description: "People who write books about Ruby and Ruby on Rails. For each author you can see all the books they have written about the topic and their contacts: twitter, website, or github.", keywords: "Ruby book authors, Ruby on Rails book authors"

INSERT INTO "authors" ("name", "content", "twitterUrl", "githubUrl", "siteUrl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Noel"], ["content", nil], ["twitterUrl", ""], ["githubUrl", ""], ["siteUrl", "asdfasdf"], ["created_at", "2022-06-18 12:13:52.751199"], ["updated_at", "2022-06-18 12:13:52.751199"]]
---
  def create
    @author = Author.new author_params
    if @author.save

SELECT "books".* FROM "books" INNER JOIN "authorings" ON "authorings"."authorabble_type" = $1 AND "authorings"."authorabble_id" = "books"."id" INNER JOIN "authors" ON "authors"."id" = "authorings"."author_id" WHERE "authors"."id" = $2  [["authorabble_type", "Book"], ["id", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "authorings" ON "authorings"."authorabble_type" = $1 AND "authorings"."authorabble_id" = "courses"."id" INNER JOIN "authors" ON "authors"."id" = "authorings"."author_id" WHERE "authors"."id" = $2  [["authorabble_type", "Course"], ["id", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @books = Book.joins(:authors).where(authors: { id: @author })
    @courses = Course.joins(:authors).where(authors: { id: @author })
    @newsletters = Newsletter.joins(:authors).where(authors: { id: @author })
    @screencasts = Screencast.joins(:authors).where(authors: { id: @author })
    @podcasts = Podcast.joins(:authors).where(authors: { id: @author })

    set_meta_tags title: "Author: #{@author.name}", description: "#{@author.name} author of #{@books.map { |book| book.title }.join(", ").html_safe}.", keywords: "#{@author.name}, #{@books.map { |book| book.title }.join(", ").html_safe}"

UPDATE "authors" SET "updated_at" = $1, "slug" = $2 WHERE "authors"."id" = $3  [["updated_at", "2022-06-22 10:34:45.064436"], ["slug", "john-smeet"], ["id", 2]]
---
  def update
    if @author.update author_params

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_author
    @author = Author.friendly.find(params[:id])