app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT "tags".* FROM "tags" ORDER BY "tags"."title" ASC
---
  def index
    set_meta_tags title: "#{Book.count} books about Ruby & Ruby on Rails", description: "The largest collection of books about Ruby & Ruby on Rails. Find books that will help you learn new versions of Ruby 3, Ruby on Rails 7, Hotwire, TurboFrame, and become a better programmer in general", keywords: 'Book, Ruby, Ruby 3, Ruby on Rails 7, Ruby on Rails 6, Hotwire, Turbo Frame, Stimulus, Vue with Rails, React with Rails, Tailwind with Rails, learn ruby, learn ruby on rails'

    #@tags = Tag.where(title: "ha")
    @tags = Tag.all.order(:title)

INSERT INTO "books" ("title", "content", "free", "page", "isbn", "getBookOnAmazonUrl", "getBookOnSiteTitle", "getBookOnSiteUrl", "created_at", "updated_at", "subtitle", "year", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @book = Book.new book_params
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ($1, $2)  [["id", 3], ["id", 5]]
---
  def show
    @book = Book.friendly.find(params[:id])
    @next_book = @book.next
    @previous_book = @book.previous

    set_meta_tags title: "Book #{@book.title}", description: "#{@book.title} by #{@book.authors.map { |author| author.name}.join(", ").html_safe}. #{@book.content}", keywords: "#{@book.tags.map {|tag| tag.title}.join(", ").html_safe}, #{@book.title}, #{@book.authors.map { |author| author.name}.join(", ").html_safe}"

UPDATE "books" SET "getBookOnSiteTitle" = $1, "getBookOnSiteUrl" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["getBookOnSiteTitle", "asdfasdf"], ["getBookOnSiteUrl", "asdf"], ["updated_at", "2022-06-22 16:06:32.232849"], ["id", 1]]
---
  def update
    if @book.update book_params

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_book
    @book = Book.friendly.find(params[:id])