app/controllers/landing_controller.rb

  def index
    @books = Book.all.limit(2).order(created_at: :desc)
    @courses = Course.all
    @tags = Tag.all
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC LIMIT $1  [["LIMIT", 2]]
SELECT "courses".* FROM "courses"
SELECT "tags".* FROM "tags"