app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    @tags = Tag.all.order(:title)
    @random = Tag.where(id: Tag.pluck(:id).sample)


    set_meta_tags title: "#{@tags.count} topics about Ruby & Ruby on Rails", description: "Choose one of the #{@tags.count} topics about Ruby, Ruby on Rails, OOP and more and find out in which books you can learn more about it.", keywords: "books, Ruby, Ruby on Rails, how to learn ruby, how to learn Ruby on Rails"

INSERT INTO "tags" ("title", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Data Bases"], ["created_at", "2022-06-22 13:34:06.413068"], ["updated_at", "2022-06-22 13:34:06.413068"], ["slug", "data-bases"]]
---
  def create
    @tag = Tag.new tag_params
    if @tag.save

SELECT "books".* FROM "books" INNER JOIN "taggings" ON "taggings"."taggable_type" = $1 AND "taggings"."taggable_id" = "books"."id" INNER JOIN "tags" ON "tags"."id" = "taggings"."tag_id" WHERE "tags"."id" = $2  [["taggable_type", "Book"], ["id", 2]]
SELECT "courses".* FROM "courses" INNER JOIN "taggings" ON "taggings"."taggable_type" = $1 AND "taggings"."taggable_id" = "courses"."id" INNER JOIN "tags" ON "tags"."id" = "taggings"."tag_id" WHERE "tags"."id" = $2  [["taggable_type", "Course"], ["id", 2]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @tags = Tag.all.order(:title)
    @books = Book.joins(:tags).where(tags: { id: @tag })
    @courses = Course.joins(:tags).where(tags: { id: @tag })

    @random = Tag.where(id: Tag.pluck(:id).sample)

    set_meta_tags title: "#{@books.count} books about #{@tag.title}", description: "#{@books.count} books about #{@tag.title}"

UPDATE "tags" SET "title" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["title", "Ruby on Rails 7"], ["updated_at", "2022-06-18 19:47:56.536593"], ["id", 3]]
---
  def update
    if @tag.update tag_params

DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 2]]
---
  def destroy
    @tag.destroy

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_tag
    @tag = Tag.friendly.find(params[:id])