app/controllers/users_controller.rb

  def show
    redirect_to root_path unless current_user == User.find(params[:id]) || current_user.admin?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]